# vsoStyleWidgetChoice

## Description
Get the item chosen in the Plug-in Object Style widget.

```pascal
PROCEDURE vsoStyleWidgetChoice(VAR choice : INTEGER);
```

```python
def vs.vsoStyleWidgetChoice():
    return choice
```

## Parameters
|Name|Type|Description|
|---|---|---|
|choice|INTEGER|   |

## Version
Availability: from Vectorworks 2017

## Category
* Object Events